<!-- dflook/terraform-github-actions {"workspace":"judo-techniques-bot","backend_type":"remote","plan_modifier":"7a443d6a7beec001441babe415b078a721aa6dc563b33c074d84f212670eb441","backend":"e6e376af407e034a3aba7952bf48d6529a550eeb593fca47d2f918456a32e4a3","plan_job_ref":"Job Terraform Plan #20 at https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6974929626","plan_hash":"b0d0eb5b97bb43057a7bb059327bd5941fc30cf985078c67b3d08f3ca5510bac","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __./terraform__ in the __judo-techniques-bot__ workspace
Replacing resources: `aws_launch_template.launch_template`
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.autoscaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "autoscaling_group" {
        id                               = "terraform-20231117155058700100000005"
        name                             = "terraform-20231117155058700100000005"
        # (27 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "********************" -> (known after apply)
            name    = "EcsClusterjtb_ecs-clusterLaunchTemplate"
          ~ version = "1" -> (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_launch_template.launch_template must be replaced
-/+ resource "aws_launch_template" "launch_template" {
      ~ arn                     = "arn:aws:ec2:us-east-2:596332158252:launch-template/lt-04d605f0b7cce0bfc" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "********************" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
        name                    = "EcsClusterjtb_ecs-clusterLaunchTemplate"
      + name_prefix             = (known after apply)
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #20](https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6974929626)